getbuf:
   0x00000000004017a8 <+0>:     sub    $0x28,%rsp #开辟40位的栈空间
   0x00000000004017ac <+4>:     mov    %rsp,%rdi #将栈顶指针指向地址作为要存储的字符串的首地址
   0x00000000004017af <+7>:     call   0x401a40 <Gets>
   0x00000000004017b4 <+12>:    mov    $0x1,%eax #返回值
   0x00000000004017b9 <+17>:    add    $0x28,%rsp
   0x00000000004017bd <+21>:    ret  

Gets:
    #可以认为行为类似于标准的gets
   0x0000000000401a40 <+0>:     push   %r12
   0x0000000000401a42 <+2>:     push   %rbp
   0x0000000000401a43 <+3>:     push   %rbx
   0x0000000000401a44 <+4>:     mov    %rdi,%r12
   0x0000000000401a47 <+7>:     movl   $0x0,0x2036b3(%rip)        # 0x605104 <gets_cnt>
   0x0000000000401a51 <+17>:    mov    %rdi,%rbx
   0x0000000000401a54 <+20>:    jmp    0x401a67 <Gets+39>
   0x0000000000401a56 <+22>:    lea    0x1(%rbx),%rbp
   0x0000000000401a5a <+26>:    mov    %al,(%rbx)
   0x0000000000401a5c <+28>:    movzbl %al,%edi
   0x0000000000401a5f <+31>:    call   0x4019a0 <save_char>
   0x0000000000401a64 <+36>:    mov    %rbp,%rbx
   0x0000000000401a67 <+39>:    mov    0x202a62(%rip),%rdi        # 0x6044d0 <infile>
   0x0000000000401a6e <+46>:    call   0x400dc0 <_IO_getc@plt>
   0x0000000000401a73 <+51>:    cmp    $0xffffffff,%eax
   0x0000000000401a76 <+54>:    je     0x401a7d <Gets+61>
   0x0000000000401a78 <+56>:    cmp    $0xa,%eax
   0x0000000000401a7b <+59>:    jne    0x401a56 <Gets+22>
   0x0000000000401a7d <+61>:    movb   $0x0,(%rbx)
   0x0000000000401a80 <+64>:    mov    $0x0,%eax
   0x0000000000401a85 <+69>:    call   0x4019f8 <save_term>
   0x0000000000401a8a <+74>:    mov    %r12,%rax
   0x0000000000401a8d <+77>:    pop    %rbx
   0x0000000000401a8e <+78>:    pop    %rbp
   0x0000000000401a8f <+79>:    pop    %r12
   0x0000000000401a91 <+81>:    ret    