0x4025cf:       "%d %d"
0x402470:       0x0000000000400f7c <phase_3 + 57>
0x402478:       0x0000000000400fb9 <phase_3 +118>
0x402480:       0x0000000000400f83 <phase_3 + 64>
0x402480:       0x0000000000400f8a <phase_3 + 71>
0x402490:       0x0000000000400f91 <phase_3 + 78>
0x402498:       0x0000000000400f98 <phase_3 + 85>
0x4024a0:       0x0000000000400f9f <phase_3 + 92>
0x4024a8:       0x0000000000400fa6 <phase_3 + 99>

phase_3:
   0x0000000000400f43 <+0>:     sub    $0x18,%rsp #开辟24个字节的空间
   0x0000000000400f47 <+4>:     lea    0xc(%rsp),%rcx #sscnf的第二个输出参数，设其为b
   0x0000000000400f4c <+9>:     lea    0x8(%rsp),%rdx #sscnf的第一个输出参数，设其为a
   0x0000000000400f51 <+14>:    mov    $0x4025cf,%esi
   0x0000000000400f56 <+19>:    mov    $0x0,%eax
   0x0000000000400f5b <+24>:    call   0x400bf0 <__isoc99_sscanf@plt> #sscanf($输入字符串$, "%d %d", &a, &b)
   0x0000000000400f60 <+29>:    cmp    $0x1,%eax
   0x0000000000400f63 <+32>:    jg     0x400f6a <phase_3+39>
   0x0000000000400f65 <+34>:    call   0x40143a <explode_bomb>
   0x0000000000400f6a <+39>:    cmpl   $0x7,0x8(%rsp) #比较a和7的大小
   0x0000000000400f6f <+44>:    ja     0x400fad <phase_3+106> #如果a>7，就爆炸
   0x0000000000400f71 <+46>:    mov    0x8(%rsp),%eax #将a的值赋给eax
   0x0000000000400f75 <+50>:    jmp    *0x402470(,%rax,8) #跳转到*(0x402470+8*a)的地址

   0x0000000000400f7c <+57>:    mov    $0xcf,%eax
   0x0000000000400f81 <+62>:    jmp    0x400fbe <phase_3+123>
   0x0000000000400f83 <+64>:    mov    $0x2c3,%eax
   0x0000000000400f88 <+69>:    jmp    0x400fbe <phase_3+123>
   0x0000000000400f8a <+71>:    mov    $0x100,%eax
   0x0000000000400f8f <+76>:    jmp    0x400fbe <phase_3+123>
   0x0000000000400f91 <+78>:    mov    $0x185,%eax
   0x0000000000400f96 <+83>:    jmp    0x400fbe <phase_3+123>
   0x0000000000400f98 <+85>:    mov    $0xce,%eax
   0x0000000000400f9d <+90>:    jmp    0x400fbe <phase_3+123>
   0x0000000000400f9f <+92>:    mov    $0x2aa,%eax
   0x0000000000400fa4 <+97>:    jmp    0x400fbe <phase_3+123>
   0x0000000000400fa6 <+99>:    mov    $0x147,%eax
   0x0000000000400fab <+104>:   jmp    0x400fbe <phase_3+123>
   0x0000000000400fad <+106>:   call   0x40143a <explode_bomb>
   0x0000000000400fb2 <+111>:   mov    $0x0,%eax
   0x0000000000400fb7 <+116>:   jmp    0x400fbe <phase_3+123>
   0x0000000000400fb9 <+118>:   mov    $0x137,%eax
   0x0000000000400fbe <+123>:   cmp    0xc(%rsp),%eax
   0x0000000000400fc2 <+127>:   je     0x400fc9 <phase_3+134>
   0x0000000000400fc4 <+129>:   call   0x40143a <explode_bomb>
   0x0000000000400fc9 <+134>:   add    $0x18,%rsp
   0x0000000000400fcd <+138>:   ret    
